# Dataframe Indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
# single column
data = pd.DataFrame([1,2,3,4])
data

   0
0  1
1  2
2  3
3  4

In [3]:
data[0]

0    1
1    2
2    3
3    4
Name: 0, dtype: int64

In [4]:
data = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
data

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [6]:
data[[0,1,2]]

   0  1  2
0  1  2  3
1  5  6  7

In [7]:
# For iloc[row,column]
data.iloc[0,1:3]

1    2
2    3
Name: 0, dtype: int64

In [8]:
# getting data for partular row or column iloc[[rows list],[column list]]
data.iloc[[1],[1,3]]

   1  3
1  6  8

In [9]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti'] 
article = [210, 211, 114, 178] 
  
auth_series = pd.Series(author) 
article_series = pd.Series(article) 
  
frame = { 'Author': auth_series, 'Article': article_series } 
  
result = pd.DataFrame(frame)

In [10]:
result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [13]:
result['Author']

0    Jitender
1     Purnima
2       Arpit
3       Jyoti
Name: Author, dtype: object